[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
<S>
<T>
!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
¡
£
¥
§
¨
ª
«
¬
®
°
±
²
³
´
µ
·
¸
º
»
¼
½
¾
Å
Æ
È
É
Í
Ö
×
Ø
Ü
Þ
ß
à
á
â
ã
ä
å
æ
ç
è
é
ê
ë
ì
í
î
ï
ñ
ò
ó
ô
õ
ö
÷
ø
ù
ú
ü
ÿ
ā
ć
Đ
Ē
ē
ę
ě
ğ
ĩ
ī
ł
Ō
ō
ŏ
ś
ş
š
ū
ƒ
ǐ
ț
ɑ
ə
ɛ
ɡ
ɪ
ʊ
ʌ
ʷ
ˈ
ˌ
ː
ˑ
˘
˛
˜
˝
́
̆
Α
Β
Δ
Ε
Ζ
Ι
Κ
Λ
Μ
Ν
Ο
Π
Σ
Τ
Φ
Χ
Ψ
Ω
ά
έ
ή
ί
α
β
γ
δ
ε
η
θ
ι
κ
λ
μ
ν
ξ
ο
π
ρ
ς
σ
τ
υ
φ
χ
ψ
ω
ό
ύ
А
В
Г
И
К
М
Н
П
Р
С
Ч
а
б
в
г
д
е
з
и
й
к
л
м
н
о
п
р
с
т
у
х
ч
ш
ы
ь
я
Ө
ִ
ַ
ָ
ּ
א
ב
ד
ה
ו
י
ל
מ
פ
ק
ר
ש
ת
ء
آ
أ
إ
ئ
ا
ب
ة
ت
ج
ح
خ
د
ذ
ر
ز
س
ش
ص
ض
ع
ف
ق
ك
ل
م
ن
ه
و
ي
َ
ُ
ِ
ّ
ْ
ک
گ
ہ
ی
ހ
ނ
ރ
އ
މ
ފ
ދ
ަ
ާ
ި
ު
ޫ
ެ
ް
ँ
ं
ः
अ
आ
इ
उ
ऊ
क
ख
ग
घ
च
छ
ज
झ
ञ
ट
ठ
ड
ण
त
थ
द
ध
न
प
फ
ब
भ
म
य
र
ल
व
श
ष
स
ह
़
ा
ि
ी
ु
ू
ृ
े
ै
ो
ौ
्
।
१
ক
ত
দ
ন
ম
য
র
ল
়
া
ি
ে
্
ਤ
ਨ
ਮ
ਰ
ਹ
ਾ
ੁ
ମ
ା
ஃ
அ
ஆ
இ
உ
ஊ
எ
ஒ
க
ங
ச
ஜ
ட
ண
த
ந
ன
ப
ம
ய
ர
ற
ல
ள
ழ
வ
ஷ
ஸ
ா
ி
ீ
ு
ூ
ெ
ே
ை
ொ
ோ
ௌ
்
ಕ
ಟ
ನ
ಪ
ರ
ಶ
ಾ
ಿ
ೆ
್
ക
ച
ട
ന
പ
യ
ര
ള
ാ
ി
ു
്
ං
ඃ
අ
ආ
ඇ
ඈ
ඉ
ඊ
උ
ඌ
ඍ
ඎ
ඏ
එ
ඒ
ඓ
ඔ
ඕ
ඖ
ක
ඛ
ග
ඝ
ඞ
ඟ
ච
ඡ
ජ
ඣ
ඤ
ඥ
ඦ
ට
ඨ
ඩ
ඪ
ණ
ඬ
ත
ථ
ද
ධ
න
ඳ
ප
ඵ
බ
භ
ම
ඹ
ය
ර
ල
ව
ශ
ෂ
ස
හ
ළ
ෆ
්
ා
ැ
ෑ
ි
ී
ු
ූ
ෘ
ෙ
ේ
ෛ
ො
ෝ
ෞ
ෟ
ෲ
ෳ
෴
ง
จ
น
ม
ล
ว
อ
ั
་
ད
န
ស
ា
្
ḍ
ḥ
ḫ
ḷ
ḻ
ṃ
ṇ
ṛ
ṟ
ṣ
ṭ
ṷ
ạ
ἀ
ἄ
Ἀ
ἰ
ὁ
ῖ
–
—
‘
’
‚
‛
“
”
•
…
′
″
⁄
€
₹
℟
℣
→
∆
−
√
∞
≈
≠
≡
≤
⋆
▲
●
◦
☆
♦
⚛
⚫
✈
⦁
⭐
、
。
い
か
が
け
こ
さ
し
す
た
て
で
と
な
に
の
は
ま
よ
ら
る
れ
を
ア
カ
チ
ト
メ
モ
ュ
リ
ル
ン
・
ー
ㄱ
ㄷ
ㅂ
ㅈ
ㅎ
一
三
上
世
中
之
九
事
五
京
人
仁
仙
令
伐
传
佛
側
傳
儀
元
光
兒
內
公
利
則
加
北
午
南
原
參
口
古
只
可
台
史
同
后
君
周
唐
善
四
国
國
土
地
城
基
堂
報
士
大
天
太
夫
奇
女
娘
媚
嬪
子
字
孛
學
安
宗
官
定
宮
家
實
寧
小
尙
局
居
山
岸
島
崇
川
州
帝
帶
平
年
府
張
後
徐
德
志
性
意
慶
成
政
文
斤
新
方
族
日
昌
明
昭
時
曌
書
月
木
本
李
村
東
楊
機
正
武
殿
氏
気
水
沖
沿
法
波
注
洋
津
洪
海
淑
渤
漢
濟
無
照
爲
玄
玉
王
生
発
白
百
皇
直
県
石
神
禍
紀
縣
羅
耶
聖
能
花
英
蘭
製
西
記
語
論
諸
謙
警
議
趙
辛
道
郡
都
醫
里
金
鎭
長
門
間
阿
院
陵
陽
雲
震
韓
食
馬
高
麗
龍
가
감
건
경
고
공
과
관
광
구
국
군
궁
금
기
김
나
남
내
녕
당
대
덕
도
동
라
려
로
릉
리
마
만
명
무
문
민
박
방
벌
보
본
봉
부
비
빈
사
산
상
생
서
선
성
세
소
송
수
숙
순
시
신
씨
아
안
야
양
어
여
연
영
오
옥
왕
용
우
원
유
육
음
의
이
인
임
자
장
전
정
제
조
종
주
지
직
진
천
촌
최
태
토
표
학
한
해
향
현
형
호
홍
화
환
황
회
후
흥
️
（
）
，
￼
👇
😉
🙂
🚂
🚉
🚌
🛤
🤔
##ි
##ද
##්
##ය
##ඥ
##ා
##ත
##ම
##ක
##ර
##ෝ
##හ
##න
##ො
##ු
##ල
##ජ
##ව
##ෙ
##ග
##ැ
##ී
##ට
##ෂ
##ස
##බ
##i
##a
##r
##d
##g
##e
##ඞ
##ඳ
##ේ
##ඩ
##ප
##ං
##ණ
##l
##f
##1
##6
##8
##0
##ඇ
##2
##7
##ශ
##භ
##o
##n
##ධ
##ළ
##ෛ
##5
##p
##x
##w
##s
##y
##m
##v
##c
##u
##t
##ඬ
##A
##h
##z
##ෞ
##ූ
##ෘ
##ඨ
##k
##ෑ
##අ
##ථ
##ච
##ඛ
##b
##4
##S
##K
##ඹ
##ෆ
##E
##ν
##θ
##ρ
##ω
##π
##ο
##ς
##9
##ඕ
##ඟ
##ඝ
##ä
##D
##R
##3
##é
##ඤ
##q
##ா
##ற
##ை
##ப
##்
##ó
##र
##ब
##्
##ह
##म
##न
##V
##ඵ
##ඉ
##ඈ
##එ
##ෟ
##ඏ
##T
##े
##व
##ी
##j
##I
##M
##O
##ਹ
##ੁ
##ආ
##Z
##C
##ඡ
##ෳ
##˜
##τ
##ά
##σ
##ι
##P
##Q
##L
##U
##X
##B
##ट
##ा
##ज
##J
##F
##️
##N
##š
##έ
##G
##ē
##ō
##W
##Y
##ṇ
##ḍ
##H
##দ
##릉
##ඒ
##ඔ
##국
##시
##대
##උ
##ं
##क
##श
##ඊ
##া
##ল
##ে
##ो
##ඃ
##ඣ
##ḥ
##の
##प
##द
##ඪ
##자
##사
##화
##ú
##á
##م
##ی
##د
##ہ
##ˌ
##왕
##×
##상
##의
##학
##ෲ
##ম
##ি
##´
##˝
##ˑ
##ि
##त
##भ
##ُ
##ت
##ِ
##ب
##َ
##ü
##ū
##ā
##˘
##ூ
##ர
##ம
##य
##ु
##±
##🛤
##ṭ
##ö
##°
##ר
##ק
##수
##촌
##च
##छ
##문
##정
##ñ
##ந
##த
##ி
##க
##ன
##®
##α
##δ
##ό
##κ
##빈
##ا
##н
##т
##о
##ш
##а
##д
##ṛ
##ல
##る
##²
##å
##ح
##ட
##ச
##ய
##ு
##ள
##வ
##ே
##ï
##स
##ृ
##ύ
##ن
##़
##в
##и
##ч
##ग
##ल
##ख
##Ζ
##Ο
##ô
##Þ
##í
##ඖ
##주
##성
##관
##부
##Í
##¬
##р
##с
##е
##й
##녕
##군
##ī
##ඓ
##¼
##к
##л
##у
##ௌ
##ध
##ः
##ç
##비
##ष
##ण
##ड
##で
##Đ
##태
##진
##ˈ
##ெ
##ஷ
##기
##ή
##ה
##ד
##ו
##ת
##м
##ل
##خ
##ر
##ṃ
##ś
##후
##지
##υ
##ඌ
##η
##μ
##ί
##Ω
##ج
##ّ
##ق
##و
##ص
##λ
##ṣ
##è
##â
##ة
##ַ
##ּ
##ত
##영
##공
##원
##−
##ε
##ø
##👇
##്
##ട
##പ
##ന
##방
##인
##ண
##ஜ
##황
##ங
##ू
##ě
##제
##금
##동
##향
##로
##ਾ
##ठ
##ऊ
##ँ
##æ
##ު
##މ
##ް
##ހ
##ޫ
##ރ
##ި
##އ
##ާ
##ழ
##ß
##യ
##ാ
##ി
##з
##ы
##마
##ै
##ඍ
##ਰ
##チ
##ュ
##ー
##ル
##씨
##্
##র
##ন
##१
##흥
##ौ
##구
##É
##ञ
##ீ
##만
##생
##∞
##⚛
##อ
##ม
##น
##ง
##ั
##ว
##จ
##÷
##¾
##ʷ
##ي
##ْ
##ك
##¨
##à
##나
##무
##メ
##リ
##カ
##ض
##ء
##Ν
##Μ
##Ι
##Ε
##라
##→
##려
##て
##い
##फ
##½
##회
##ì
##조
##선
##Α
##ḷ
##￼
##ொ
##õ
##я
##б
##ê
##ೆ
##ಟ
##್
##ಿ
##ć
##민
##한
##ា
##ަ
##육
##ş
##내
##ə
##안
##س
##た
##µ
##과
##थ
##ב
##י
##야
##ع
##х
##ש
##보
##토
##ف
##ز
##घ
##ÿ
##ę
##К
##형
##표
##ه
##이
##Δ
##́
##п
##ь
##ඦ
##γ
##ମ
##ା
##경
##ோ
##ರ
##ಕ
##ಾ
##º
##ɑ
##ː
##ʌ
##궁
##고
##당
##ł
##ɪ
##ஸ
##리
##장
##Λ
##א
##ל
##감
##ދ
##ನ
##¸
##φ
##ま
##か
##ئ
##は
##と
##す
##현
##よ
##し
##こ
##ª
##̆
##≡
##Β
##Κ
##れ
##해
##β
##ã
##г
##≤
##Æ
##ര
##ਨ
##ു
##ള
##ɡ
##종
##덕
##순
##گ
##˛
##벌
##¥
##け
##🚂
##ക
##ಶ
##오
##ț
##ஆ
##ë
##서
##🙂
##도
##ṷ
##신
##환
##उ
##ἰ
##χ
##়
##호
##î
##ʊ
##ù
##ش
##Ü
##ނ
##😉
##건
##ŏ
##⁄
##산
##أ
##ִ
##ン
##ಪ
##ެ
##ਤ
##န
##ک
##유
##ذ
##€
##Σ
##ò
##양
##직
##ล
##ψ
##に
##ඎ
##ད
##ト
##ਮ
##전
##³
##🚌
##ạ
##연
##∆
##세
##음
##ṟ
##ḫ
##ξ
##が
##ア
##ㄱ
##아
##な
##آ
##য
##✈
##ǐ
##용
##ğ
##ָ
##Ē
##פ
##្
##ស
##어
##임
##본
##È
##モ
##إ
##ḻ
##광
##ῖ
##С
##Р
##ɛ
##Å
##ক
##ら
##명
##ފ
##झ
##숙
##옥
##박
##송
##천
##ஊ
##ĩ
##봉
##מ
##ἀ
##☆
##න්
##ත්
##ක්
##ිය
##්ර
##ර්
##ාව
##ම්
##ින්
වි
##ස්
##ති
##ුව
##ීම
##නය
##ෙන්
##්ය
##හි
##ල්
ප්ර
##යි
##ිර
##ික
##යේ
##ාර
කර
##තු
##ෙන
##මා
##වා
සි
##තර
මෙ
##නු
##ාල
##ගේ
නි
##ණය
##දී
සහ
##ුර
##ෙස
##ිත
##න්න
##නි
##හා
##ුද
අතර
පි
##යක්
හා
හැ
##ුණ
වැ
##කි
##ුන්
##වි
වන
ලෙස
සං
කිර
සම
##ක්ෂ
පැ
##ත්ව
වූ
##යන්
ක්ර
##නා
##ියා
##ිබ
මෙම
##යෙන්
අව
##ීමට
##රි
කො
##හු
නො
##ාය
##දු
##ාර්
##යට
##ැන
##ාන
##ට්
ස්
බව
ඇති
##කර
##ත්ර
##ලි
විස
විය
වේ
දි
##දි
සඳ
ඇත
##he
##යා
##තා
##සු
##සා
##දා
##ලා
##කු
වෙ
##ංග
##ෙහි
කළ
දෙ
##වන
විශ
විසින්
##ද්
##ේශ
තු
##ද්ය
##සි
##තිය
##වර
19
##කා
සිට
##ෙර
ඔහු
දී
වර්
කරන
##er
##මි
සඳහා
වල
සම්
සා
##ැබ
##ාජ
අන
##වල
##න්ද
##මු
##සේ
කිරීම
##න්ත
##ාවේ
නැ
සැ
යු
පිළ
##ත්ත
දැ
##ීය
මු
##ඩා
ලබ
##රු
##ුණු
##in
##කාර
##මය
##00
##වේ
##on
හෝ
එය
##ෂ්
පව
හි
##කට
the
මි
##පා
##න්නේ
පරි
වෙන
අධ
සිය
##රා
##at
##ප්
##ඩි
##ණ්
කු
##ස්ථ
##තුව
##ණි
##ිරි
විද්ය
##an
තිබ
මේ
ලැබ
යන
##ටි
##es
එම
##ුද්
බල
ප්රති
රාජ
ජන
##ල්ල
##ණ්ඩ
##වැ
හැක
##ානය
##මින්
##වත්
ශ්ර
##en
භාව
එක්
##or
ගැන
##ොහ
##තාව
කොට
##හැ
##සර
##දේශ
මැ
##al
##ාග
දක්
උප
කල
රජ
##තික
##ංක
සමා
කි
##හන්
ක්
##ෙකු
##ෙක්
##ාප
##ළු
##ත්ම
වී
##ed
##ූප
කාල
නම්
පිළිබ
##ද්ධ
##යු
අප
##ුරු
##ාම
##විය
භාවිත
##ියාව
##ාස
එක
##න්ධ
##මණ
##ලය
##ar
##වුන්
බැ
සිදු
##කය
විට
##ර්මා
##ගින්
##ේෂ
##ධාන
##ic
##කින්
##ෝග
##ීන්
##ඩ්
එහි
##ුවන්
##ත්වය
වශ
යනු
##ියේ
පො
##නේ
අය
ව්ය
නිසා
බොහ
ආර
කැ
##ගම
##it
වශයෙන්
##පත්
ලදී
මහ
##ගත
##ව්
ගො
මෙය
තුළ
පිහි
##න්ය
ගැ
මත
##නයේ
##ලිය
##තුර
යො
ශ්රී
පහ
පිළිබඳ
##වීම
##ක්ර
පු
##nd
පමණ
බොහෝ
##ංශ
of
##වී
අනුව
පළ
හේ
තර
##මේ
බි
##ගෙන
හැකි
වඩා
ඔවුන්
ජා
ලද
දින
##වු
කිරීමට
සු
අනු
චි
##මන්
ස්ථ
සේ
##හාර
පසු
##ප්ර
##is
කා
##විධ
කට
වැඩි
වීම
##ත්මක
පර
##කාශ
##සුව
##න්නා
කෙර
##ion
ලබා
දු
වැනි
##ම්බ
20
##වර්
පුර
වසර
##ගත්
##ුදු
නිර්මා
##ing
in
පත්
##ුද්ධ
ලංක
මගින්
දේ
200
අඩ
##හර
##ත්තේ
චිත්ර
පැව
##ටු
##ලක
මා
රට
සම්බ
අධ්ය
පා
##දුව
නිර
තුල
##මුත්
##ොර
සමග
රැ
මෙහි
ප්රධාන
ග්ර
##ූල
##re
##තුරු
ජී
යුතු
##ෝක
බවට
##පය
අග
##මක්
##දන
විශේෂ
පාල
##ියානු
##ාවක්
පෙර
##දය
##as
##වූ
ක්රියා
ඔහුගේ
හම
අද
##ීත
වෙත
දේශ
වන්නේ
කරයි
සද
##ධ්ය
භාවිතා
##මැ
සම්බන්ධ
නිය
ප්රදේශ
##ගර
විශ්
විශාල
ඇතු
ඉද
හෙ
දක්වා
##ම්භ
##ිකා
නමුත්
##ත්ය
සාමා
සො
##ටන්
සිදුව
ප්රමා
##හෙ
රාජ්ය
##පි
##පට
##ර්ථ
##යින්
##නී
##ීම්
##ගල
and
##ටා
##හල
සිටි
ක්රි
ඒවා
##om
##ou
##සන්
ඇය
##ූර්
##ච්
භා
##ණයක්
නා
වා
##නට
##හිත
##ෝජ
##ීර
ගණ
##ලු
නව
##ාවන්
ලි
පසුව
##තන
##ියන්
වැඩ
##ෑම
##ීන
දිය
##හිර
##කම්
##ෙන්ම
චිත්රපට
##ර්ශ
ඉතා
##භාව
වර්ග
##ලේ
##විත
##ැයි
##යුතු
පෙ
18
යට
##ඳු
ගැනීම
##ස්ත
ක්රම
පිරි
යොදා
##ශ්ය
##බ්
අවස්ථ
වෙනස්
##චාර
ඉන්
to
ශි
වු
කරනු
##le
##වය
201
විවිධ
##තේ
##ශ්
##ායක
සමාජ
දෙක
##ජි
##වත
මහා
##කරණය
කෙ
##ල්ප
##යක
සදහා
##මර
ගෙන
නී
අභ
දෙන
දැක්
##ොන්
නගර
##වාස
##යේදී
##තනය
වලට
කටයුතු
##ාරි
කාර්
##ධනය
##ුවේ
තම
##කෘ
හේතුව
මාර්
ගත
##ක්ෂණ
ලංකාවේ
##ent
##දෙන
##තිවර
##ණු
##මට
##st
##ීට
##නම්
බ්ර
මූල
##ධි
ඉන්ද
##ට්ර
##දනය
ආකාර
##ව්ය
##ාවට
පිළි
විද්යා
##ළි
##ඛ්ය
##පාල
ගි
නිර්මාණය
##හස්
##මත්
##ුවෙන්
##ැන්
##el
##ඳින්
##am
##ාන්
සහිත
##ට්ට
##ශ්ර
පුද්
##පද
ප්රකාශ
##සිය
වලින්
ලෝක
##හාස
රජු
ආරම්භ
හැකිය
##ගය
වර
##et
මධ්ය
##හන්සේ
##සත්
##ර්ම
ඉහ
කලා
හමුද
##නික
##ීමේ
##සක්
##ගෙන්
වර්ෂ
හො
වෙයි
පැමි
භූ
##බි
කළේ
සංග
ජාතික
ශා
නිෂ්
මො
බෙ
##වින්
මුල්
##ගැන
සාමාන්ය
##කුණු
##වෙ
පිට
කිය
##තිහාස
වාර්
අම
##මික
අර
##ලෝ
තව
ඇත්තේ
##තී
##ක්ක
##තින
අන්ත
වූයේ
##ro
අත
පැහැ
භාෂ
##ct
##ඳුන්
##දිය
ලැබේ
නිෂ්පා
මිනි
සිං
##ග්
##රණ
අවශ්ය
ගොඩ
##නිය
##il
සමඟ
##ුවර
මුද
##ලින්
කෘ
ලේ
ප්රා
අත්
##දේ
##යෙහි
හැඳින්
ආය
##ol
වැද
රෝග
##පු
පද්ධ
##බා
ක්රී
අස
ක්ෂ
සංක
පුරා
සංස්
පැවැ
එක්සත්
##ෙනි
පත්ව
එසේ
##ධාර
බවයි
වග
##වයි
##ෝල
##ෙල්
තා
##ක්ත
##ක්ෂණය
යෙ
උත්
##ෝප
සොයා
ද්ර
ගත්
ගැනීමට
##ට්ඨ
කිරීමේ
##තුන්
##ation
මැතිවර
හර
අන්තර්
දර
රූප
##ජා
නැවත
අයත්
##රණය
##ෝධ
සැලක
පවතින
##නයක්
විද්යාව
##න්නට
##නයට
##ඩු
##මාන
##කො
th
අඩු
##ටුව
##කරණ
ගන්නා
##ch
නිද
වෙළ
මුහ
##යකි
තිබේ
කුඩා
##ir
දුර
පෙන්
##ග්ර
අයි
වහන්සේ
තවත්
රෝ
##ෙසේ
හඳුන්
වුව
සංඛ්ය
සමහර
තොර
##ම්ප
##වලට
##මැති
##ad
##න්ද්ර
පළමු
199
ඉදිරි
##සට
උදා
##විට
##ක්රම
බලප
රු
##ුත්
##වීමට
කිහි
##සුන්
ලක්
##ියක්
ආරක්ෂ
##ෙයි
වැදගත්
කණ්ඩ
පූ
සඳහන්
සියව
##වාහ
කෙසේ
ඉහළ
ස්ථානය
The
ස්ව
ලෙසින්
##පුර
මඟ
##ෙන්නේ
##කයන්
කෝ
කණ්ඩාය
##නක්
##ප්ත
කාලය
ලා
පෙන
කොට්ඨ
මාන
##ot
කිරි
##න්ත්ර
පාස
දකුණු
##ri
නිරූප
මීට
බහු
පමණක්
පාලනය
##ෝස්
කාර්ය
ආර්ථ
10
##ිතා
පැවති
ප්රථ
මෙන්ම
දැක
##දර
##ගු
ව්යාප
අධික
සී
පර්
පාර්
දේශපාල
යුද්ධ
වෛ
සැල
##නැ
##කිර
ක්රියාව
රස
for
##ස්ස
##ුවක්
##කාල
##තම
ඉතිහාස
පිහිටි
රා
##වල්
වෙනත්
කරමින්
ලො
ගේ
පෘ
ආස
ප්රමාණය
ඔවුන්ගේ
##දීම
##ුණි
ආහාර
##ම්බර්
##වරුන්
යන්න
##ොත්
##වැනි
සෙ
##ගණ
##iv
ආර්ථික
##ියට
##ෆ්
##ේක්ෂ
198
සිංහල
වර්ත
##සුම්
ගුවන්
##ce
##ැම්
සංස්කෘ
##ළඹ
යටතේ
##ිනි
##ly
##id
##ලර්
##ur
පැමිණ
##ුවට
ගෙ
තේ
##ter
##නෙ
##ෙකුත්
is
පවතී
##ow
දැන
නොහැ
කේ
තැන
යුග
ලදි
ඇමර
##ාලය
හිමි
##වලින්
##රිත
අප්ර
##ාර්ථ
වෙන්
බට
පුද්ගල
197
දක්නට
බෝ
##පති
##ස්ට
නොවන
17
ශක්
ප්රථම
මෙහෙ
##ිකාව
නිල
යම්
##ිකානු
ත්ර
##ර්ය
අධ්යාප
##රඹ
##වනු
15
නැත
එනම්
ලං
##නෝ
පී
විර
ආගම
ලබන
##ut
ඉදිරිපත්
##ස්ථානය
##වන්
වඩාත්
හැර
re
##ලී
යුර
##ul
තීර
##වාදී
වර්ධනය
කිසි
සමාන
චරිත
16
##වාද
දර්ශ
##ෂ්ඨ
##තින්
උස
වීමට
##ay
##ුවා
අර්
##ia
විශ්ව
##ස්තර
ලද්
##ජන
##වෙන
විශ්වාස
ඇතැම්
පද්ධතිය
හට
මඟින්
##මන
##යික
ක්රමය
දෙවන
තත්
##දුර
බවත්
##තුමා
##කාරී
කොටස්
##ිරාජ
ලබයි
##ීර්
##න්විත
සීම
සිර
##us
ඒක
ලංකා
පක්ෂ
නික
##දාය
##කරන
පිහිටා
be
පරිගණ
බටහිර
##චි
කළේය
හේතුවෙන්
අති
ඇතුළ
බා
අංශ
මාල
යැයි
මැතිවරණ
උදාහර
##ෂ්ට
අධිරාජ
නීති
##තාවය
##im
පදන
නොව
අවස්ථාව
##ලන්ත
යා
##පයක්
##ල්ලා
##හස
12
##න්ට
ඇම
සිටින
අධ්යය
පැවැත්ව
##ූර
සංවිධ
පිළිබඳව
සට
##ද්ර
සම්ප්ර
අර්ථ
තෙ
ජය
##කල
##em
අනෙකුත්
මණ්ඩ
##ාත්මක
##ෙස්
දෙස
දිස්
##පූර්
##න්තර
##ig
##ෝෂ
##os
වසරේ
196
##ාසය
පරිදි
##ers
ගැට
##තය
##ත්රි
විහාර
as
සෑම
සමන්විත
ලෝ
##ටත්
ඉඩ
ලිය
හැකියාව
##ාරය
පැහැදි
පිළිබද
ජීව
##ුවත්
මාර්ග
##ියාවේ
පවු
තෝ
මූලික
සර
##od
##ංගු
##and
කොර
##um
##ඵල
ඇගේ
කතා
විෂ
හේතු
##දුන්
පිය
##තීන්
##ලට
##ag
වාර්තා
##ංග්ර
නිරූපණය
##ැක්
st
අවුර
මෙන්
##මිය
ති
##යන්ට
මට්ට
ගෝ
විස්තර
##යෝග
සියලු
යාම
සංගීත
##හන
අනතුර
##නාව
ගමන්
##ලියන
තමන්
##හය
සංවිධානය
තොරතුරු
##ෙකි
කෙරේ
විවාහ
##භාග
මානව
අවධ
##ිතාන්ය
on
අමතර
බ්රිතාන්ය
කථ
නීතිය
දේව
or
අල
##ගි
පැර
ඊට
උද
##ේත්ර
අරම
ලද්දේ
##මාර
අවසන්
11
පද
##පො
##න්ගේ
මිය
##කරුවන්
ජල
ඉල
එර
යුතුය
##මත
##ra
වාය
සුදු
නිර්මාණ
වෘ
##ෂණ
##සින්
##පත
පියා
න්ය
ද්
වෙනුවෙන්
ද්රව්ය
##ඩිය
හරහා
##හැර
##ීමෙන්
ලබාග
ගුණ
##ගන්නා
ගොඩනැ
උතුරු
එහෙ
ජෝ
##න්තු
ඇරඹ
##සී
දේශපාලන
##ස්තුව
ඔහුට
හෙවත්
බුද්ධ
තිබූ
##ොක්
##කම
##ith
ඔස්
සේව
ගිය
##කළ
##ගලය
ස්වා
පවත්
ක්ෂේත්ර
##ik
සංවර්
ව්යා
හමුදා
##න්ඩ
සක
ජීවිත
##ොං
අභ්ය
ජනපද
##ist
පරිගණක
##යාගේ
භාෂාව
නොවේ
බලය
වෙළඳ
පොදු
වය
ක්රියාත්මක
සාමාන්යයෙන්
විදු
නිර්
රච
දිග
##දර්ශ
විනා
ව්යව
නොහැකි
ඉංග්ර
බෞ
##දින්
වර්ණ
194
ගු
##යන්ගේ
රි
##ීසි
බලා
නිෂ්පාදනය
නෙ
නම
ක්රීඩා
නිපද
##ංගික
##්ල
ශාක
##බල
ලොව
සාමාජ
##ච්ඡ
දෙවිය
කොළඹ
ස්වභාව
එසේම
දිස්ත්රි
පල
සුව
##ලිමේ
එයට
වර්තමා
##ණිය
නියම
##ටිය
##ර්මාන්ත
පර්යේ
සෝ
රසාය
##ෂ්ය
පහත
බෞද්ධ
14
එකක්
##යෙකු
##සයි
##දේශීය
පරී
ප්රතිඵල
ක්රීඩ
අදහස්
කරන්නේ
##ූන්
පාර්ලිමේ
##ෝන
##th
නමින්
ලංකාව
##ට්ය
මුල
ලැබූ
බුද
##රාධ
දහ
බිහි
##බර්
##ුණේ
පළා
##ෙක
195
තරග
ජනතාව
නැගෙන
මේවා
මාස
ප්රභ
සම්පූර්
සන්න
##ගැ
කාන්ත
පුද්ගලය
පැහැදිලි
##සිද්ධ
කෙරෙහි
##ශ්ච
13
වෛද්ය
al
යනුවෙන්
රාජධාන
##op
##ාර්ය
නැති
ජේ
දෙකක්
##ර්ග
රේ
අමතරව
##ජ්
ආයතනය
නාම
##වාරි
##est
හඳු
පිහිටුව
දේවා
##ip
##වාහි
රො
නොමැති
අංග
##පිය
යොමු
##ුවන
ලක්ෂණ
එල්ල
con
##ලාව
විම
##ටය
අභි
##වෘ
##හොත්
de
සැක
සිද්ධ
එහෙත්
හඳුනා
අනතුරුව
ජලය
ලේඛ
an
සෞ
කිහිපයක්
##ධන
##ත්වයක්
විද්යාත්මක
දෙම
නායක
කාලයේ
##ෂික
මෙසේ
සාමාජික
විජ
with
In
##ස්තු
##කයින්
නැගෙනහිර
##ැම්බර්
වැඩසට
##චනය
ජනප්ර
##ග්රහ
ගනී
##ess
වනු
නාට්ය
බැවින්
මිලියන
##ගැනීම
##ac
ව්යාපාර
එරෙහි
000
දායක
##ාර්ථක
by
මස
වට
was
ප්රමාණයක්
සියවසේ
##ලිම්
විනාශ
ජනා
තැ
##තියක්
තරඟ
##යකට
පරිසර
ඉදික
එන
##මයක්
එකම
##න්ථ
ශිල්ප
නගරය
##සල
පිල
සමාගම
තමා
මහතා
ඉවත්
##නුම්
ඩි
com
දිනය
නියෝජ
##un
##her
තෝරා
##වීම්
මුළු
##ෂ්ණ
##ධක
පන්
පිහිට
මෙහිදී
විශේෂයෙන්
හොඳ
##චල
තහ
පදනම්
වැට
කර්මාන්ත
ඇතුළු
##ෝට
##ver
##ies
භාග
##ාවි
දැඩි
##ක්ෂි
##බැ
##ච්ච
චන්ද්ර
##කයා
වුවද
පැරණි
චිත්රපටය
මෘ
යි
##ාශ
##විද්ය
##ොහො
හදුන්
සතුන්
##නුවර
දෙදෙන
ඇස
##හ්
නාමය
නිදහස්
ග්රන්ථ
රූපවාහි
##ේද
ඇතුළත්
##ගා
that
##හී
##මාව
##සව
wh
ස්ථාන
##ියේය
බලපෑ
පරමා
ගණන
ඉන්දියානු
##ain
උපා
##සන
රටවල්
තිර
ඩො
##ak
යයි
මග
##av
##කාලීන
පූර්
භාර
ධර්ම
##පැ
සාහි
##ෝල්
##මෙන්
තවද
මාධ්ය
##ලයේ
##ණික
ගීත
##ජන්
සෑ
අනෙක්
##හල්
සලක
##රදි
ඔබ
බො
##ලව
##ජී
##යන්තර
##ංශය
##දාන
ජනාධි
##සිං
ගල්
##ලක්
ඉංග්රීසි
විද්යාඥ
සූ
සිටිය
පවත්වා
##se
භෞ
ගිවි
##ab
##නයන්
##රිණි
භාණ්ඩ
පරා
ප්රහාර
##ලෙස
##සාන
උපත
##තිර
යුද
##ate
දත්ත
අවසා
##oc
##කොට
##තියේ
ඔවු
##සික
##if
##ත්යන්තර
##මී
පුවත්
සභ
##යුම්
##කඩ
මී
මිනිසුන්
සාහිත්ය
##ලත්
##පිට
ඉස්
##වාදය
සමී
යුධ
ප්රාදේශීය
පිලිබ
යුක්ත
යුරෝප
ජූ
##ථි
මෘදු
##කුණ
විකාශ
##ශී
##නයා
වලදී
අධිරාජ්ය
වර්තමානයේ
##යයි
යෝජ
##වරු
##වීමේ
තිබෙන
##ත්වයට
පෞ
ආදී
ජාත්යන්තර
##රට
##ෛල
කී
මුහුණ
සටන්
##ud
සතු
##යකින්
##ඳි
ආශ්ර
පහළ
සල
##ap
අඩංගු
තන
එමෙන්ම
කිරීමෙන්
වායු
බී
##ස්ත්ර
ගා
ලිංගික
තීරණය
##යෙක්
##ard
අවුරුදු
are
ලැබෙන
##සීම
##නයෙන්
ඔස්සේ
හින්
පම
සිතුව
##නිමින්
කලාප
නිකුත්
පළම
අතීත
අර්ධ
##ts
##ඩ්ර
රැක
##ගැනීමට
සුළු
ලෝකයේ
දෙමළ
කරන්න
ස්ක
ආණ්ඩ
##බර
ඇල්
සේවය
ඇමෙර
pro
දෙප
යුගයේ
විද්යාල
හැඩ
ජනප්රිය
කොට්ඨාශ
##ධා
පෙළ
##සුන
ලේකම්
##සිංහ
##ගමනය
නිස
##ගො
නූ
පුළු
##our
මන්ත්ර
දැන්
චී
තාර
දෘ
##යකු
උත්සා
##දැ
30
##ගම්
##දීය
##ලො
##ඤ්
සාර්ථක
##කීය
කැර
##ජු
##ෙව්
කාලයක්
සත්ව
කරුණු
එකි
ඉතිහාසය
ස්ට
##ොට
පාර
se
කාබ
රජුගේ
භෞතික
##කාංග
සත්
##ෝර්
##ාපනය
25
##දක්
අවධානය
පට
ඉහල
නාග
හතර
එකිනෙ
##ිකාවේ
අතුර
ප්රමාණ
යටත්
ආගමික
ගත්තේ
රංග
දිස්ත්රික්ක
සර්
##ස්ට්
හිමික
පෘථි
පර්යේෂණ
##og
දළ
සකස්
##කූල
##ගාර
##ුද්ර
උසස්
ගනු
සත්ය
පවා
දියුණු
ක්රියාවලිය
##ිණි
ප්රදේශයේ
##තක
##ංච
සංචාර
##සියම්
තර්
වෙනුවට
අන්
මරණය
අදාල
ඕන
පැමිණි
ඉන්දියාවේ
තනි
##චාර්ය
කොටස
අවම
##ගහ
##තිහාසික
තිබු
දශ
පුළුල්
##ෂණය
##ීමක්
හඳුන්වා
උෂ්ණ
පටන්
සිදුවන
100
රටවල
##ුරින්
කඩ
ඇමරිකානු
කියා
##ාවෙන්
එන්
අධ්යයනය
##ද්රව්ය
මිල
තත්වය
ඡාය
##මිනි
##ity
##දක
මතු
රූ
කොටසක්
සෘ
රජයේ
බැඳ
පාර්ලිමේන්තු
තරම්
සියළු
එහිදී
භි
පහසු
මැද
##නයි
ශ්රේ
සේවා
මෘදුකාංග
##මනා
මුද්ර
චීන
##පී
ප්රසිද්ධ
##සං
ග්රී
අධි
විද්යාලය
##රිය
නාල
මෙයට
##ල්පය
යුත්
ව්යවස්ථ
##ගී
##rom
යැ
##නො
##ර්මය
ශක්ති
ස්වර
su
##ලේෂ
##ප්ප
ඊජි
ජු
පන
##සය
en
##ාරූප
##ld
සමයේ
ශක්තිය
රජය
##යෝ
එකතු
ලක්ෂ
එරෙහිව
ආකෘ
කාර
මූ
##ric
##ම්ස්
නිව
තබා
##යෝජ
කිරීම්
##කරු
##දායික
ලබන්නේ
නිෂ්පාදන
ආකාරයට
##්රිය
සාධක
##ස්ථාන
තුළින්
193
ජි
තුන්
ස්ත්ර
දරුවන්
දැම
රාජව
සම්බන්ධයෙන්
සැලසුම්
##මුඛ
ක්රියාකාර
ex
මැතිවරණය
උත්සාහ
චල
සහභාග
කණ්ඩායම්
අංක
සුර
##ටර්
අතරතුර
මල්
මනෝ
##ූහ
කෙරිණි
දැක්විය
සින
ගොස්
ඉදිර
##බෝධ
##විල්
##ිතව
තුන
##ට්ලර්
තෙක්
ගම්
කලේ
පද්ධති
ධා
පොළ
##ැති
##ටම
හිම
අධ්යාපන
##කයේ
##කෝ
සමත්
දෙවියන්
විසිනි
සංවර්ධනය
ඉක්
##pe
##ිකට්
රූපවාහිනී
කෙරෙන
##ක්රමණය
ආයතන
සම්පූර්ණ
ආදිය
##වෙන්නේ
##ාන්තර
සංඛ්යා
හිට්ලර්
##සුම
##පේක්ෂ
br
##සිර
තැබ
පත්ර
දුන්
වූහ
ප්රංශ
##නායක
සිත
##ෑන්
දුම
කළහ
##වික
##ැල්
##වරයා
ප්රදේශය
බර
වර්ෂයේ
අන්තර්ගත
මැයි
##ුරුෂ
ඉන්දියාව
නූතන
21
##ත්න
තිබුණි
අගය
දැනට
ඔක්
මධ්යම
බුදු
රෙ
සියල්ල
පහර
ගැනීමේ
##යුර
පුහ
##ive
##කල්ප
ජනයා
දීම
යෙද
ආසන්න
ආදි
##ේල්
22
##තෘ
මුදල්
ගෘ
සූර්
පරිවර්
ඡායාරූප
භික්ෂ
ගෞ
ආරක්ෂා
නිලධාර
අවස්ථා
##ඤ්ඤ
විද්යුත්
##වුරු
##ang
වේද
ඓතිහාසික
##රය
ලැයි
##ෙල
ප්රදර්ශ
කිහිපය
wik
මාර්ගය
ඉලෙක්
උදාහරණයක්
නිවැ
##යන්හි
##කර්
සැලකිය
##ණා
ග්රහ
##මානය
බැල
හමුදාව
නිළ
රාජකීය
පේ
පැතිර
අවසාන
මාර්තු
පෙන්වා
මන්ත්රී
චෝ
##ම්ප්ර
ව්යු
භාෂා
##ඹුරු
ක්රිකට්
කොට්ඨාසය
හී
තාක්ෂණ
ඉලෙක්ට්ර
##ළුව
ඉල්ල
##ිතය
##ාරා
මන
අපේක්ෂ
පීඩ
සම්මත
සංඛ්යාව
බු
##ෂා
##ical
ගොඩනැගි
දිනදී
ඊජිප්
මව
සපය
##tt
වළ
එස්
192
අවි
##දුම්
##කයක්
නිරී
ඉහත
##වෘත
වංශ
ශත
පැන
පාරි
##ual
##ගිය
##පසු
ගුරු
ඇල
අධ්යාපනය
ආකාරය
පස්
##ෙහිදී
##වේද
බෙදා
අම්
විෂය
එමගින්
හමුව
බිඳ
##ීකරණය
අතරින්
පිණි
ශර
විද්යාවේ
පැවත
දක්වන
##හසු
##ine
අක්
##ශේෂ
රැස්
උඩ
පුරුෂ
##ස්ම
යුද්ධය
රසායනික
ආදාය
වේග
සන්නි
කෙන
##ල්ස්
යුගය
##ich
##ගෙ
##ක්ස්
දැකිය
සංකීර්
කල්
නිම
##ද්ගල
ජනගහ
වගා
සුදුසු
ඝා
ට්ර
අතින්
##චන
ප්රව
භාවිතය
සියවස
##ill
සංකේ
වනුයේ
දිස්ත්රික්කයේ
දා
##තිරි
කළු
pl
##ලිස්
තත්ව
දුම්රිය
##ංජි
හැදින්
ජනාධිපති
ලී
##කිරීම
කෙටි
තාප
රාජධානිය
වනාන්තර
මිනිස්
##සියන්
##ද්ද
පාලන
සෛල
##වරණය
මොවුන්
ලාංක
සීමා
##රළ
අරමුණ
අනා
මෙවැනි
##ද්ගලික
සබ
##න්දේ
අක්ෂ
##ක්ති
වන්නට
කථා
##දුරටත්
##ේප
සටහන්
ඕනෑම
##දුරු
##ial
##තාවක්
##ost
කණ්ඩායම
කරුණ
විදුලි
අඩි
වැඩිම
කම්
ඝන
##වක්
##ස්ට්ර
අවබෝධ
කුම
##ore
පමණි
ඇයට
##ant
##ෝස්තු
අවසානයේ
##ත්ති
මිනිසා
St
##්රා
ආර්
සංස්කෘතික
##ලික
##ගුණ
##කිය
##දින
උදාහරණ
හයි
##ුම්
එකල
මෝ
වැළ
##art
##සෝ
සාපේක්ෂ
පෞද්ගලික
##වහන්සේ
වුයේ
ආයු
සදහන්
ඇතිවන
භූමි
වාස
ෆ්ර
##ත්තා
##කේ
වෙමින්
කතාමා
යෝජනා
##ew
##ෙකුට
රතු
මුලින්
මිශ්ර
24
##ාවලිය
කරග
නගරයේ
ඒවායේ
බේ
ප්රකාශයට
සමස්ත
ත්රි
එවැනි
වටා
##රුම
##වන්නේ
##ත්යා
Ch
අඟ
##ුම
##ගන්
සැම
ද්වි
සෞඛ්ය
වො
විවෘත
මණ්ඩලය
රන්
කරගත්
වෙතින්
හැසිර
සැලකේ
ජීවත්
වුවත්
මුහුදු
වර්තමාන
ජාතීන්
සූර්ය
##ටෝ
ව්යාප්ත
from
අතුරින්
මෙහෙයුම්
##ත්වන
වෙබ්
තාක්ෂණය
පූර්ව
තැන්
බාල
##ලෝක
නිවැරදි
දිගු
ගෘහ
##ටුම්
පාසල්
හින්දු
ලෙසද
##ෝගික
ටී
කරගෙන
සාම්ප්ර
මහජන
මෑ
පිණිස
##හත්
##pp
මරණ
නර්
ප්රශ්
අගෝස්තු
වස්තුව
චරිතය
##ොස
##ib
කාණ්ඩ
යානය
ඉටු
මම
##ර්ණ
ස්ප
කින්
සැපය
##ට්ස්
mat
ප්රමුඛ
##ණයෙන්
ආරක්ෂක
ප්රතිපත්
වින්
සිවිල්
විරුද්ධ
අණ
මුස්
කලාව
ආණ්ඩු
##කදී
ලැබීය
තවදුරටත්
##ාවිද්ය
පිලිබඳ
සැප්ත
##වුම්
කඳු
විශ්වවිද්ය
##තරම්
අයිති
##දෙස්
##ph
##ian
පස
2007
කිරිම
සිතුවම්
උළ
##ust
ඡන්ද
අට
##ගෝල
ශරීර
##නුම
ජනප
අල්
නොවැ
රාජ්යය
මාර
##හේ
සමාජය
තො
තී
දුර්
##qu
සම්මාන
50
ඔක්ත
රැජි
##බු
ඉංජි
II
##all
සතර
ගනිමින්
##සර්
##ංචි
සිහි
ජනවාරි
අප්රේල්
ඉංජිනේ
##දිග
සැප
ලිපි
ඉතිරි
ඇතැයි
කාම
##කරුව
සෙන
##ඹු
ආධාර
##තට
නැමැති
වෙති
අමා
##පන්
##ණන්
##ment
##පල
ප්රතිකාර
තත්ත්වය
ඉස්ලා
ජපා
##ටිනා
සිදුවේ
නිශ්ච
කත
අභ්යන්තර
සුවි
තුලින්
මාලි
##ගැන්
##ක්ෂේප
ඇතුලත්
හොඳම
නුවර
අක
විශ්ලේෂ
##පික්
කොරියානු
පළාතේ
##පර
##තියට
සිටියේ
##තුවේ
191
##ඩියෝ
ලැයිස්තුව
රථ
##gh
##ාලි
පෘථිවිය
ශුද්ධ
සභාව
හැඳින්වේ
සිරි
ප්රේ
සාක්ෂි
2008
23
අනාව
කිසිදු
##ියක
##හුව
මෙහෙය
යුරෝ
ජනපදය
##ියෙන්
බිම්
කාන්තාවන්
##ඩුව
පිරිස
බලපෑම
පෙනී
##කථ
කෘෂික
වීමේ
පරමාණු
##ාවල
උදෙස
මුස්ලිම්
##තක්
##වතුන්
සැළ
පුරාවිද්ය
##භාවය
ලෙ
කාලීන
රුස
##igh
ඒකා
ගෝල
කිසියම්
te
දෙව
කැන
කුල
##ell
මරා
පරාජ
ශාස්ත්ර
බලපෑම්
පාසැල්
අනි
##ect
සාක
පිරිසක්
ශිෂ්ය
ඉදි
වස
චිත්රපටයේ
පිළිවෙ
ස්කන්ධ
මන්ද
not
ජෛ
##සාර
අනුගමනය
##ණයට
සැප්තැම්බර්
##age
අනුරාධ
දසුන
වෙතත්
ශබ්
දැකගත
ව්යාපෘ
වටිනා
පරීක්ෂ
##දාළ
අවස්ථාවේ
##ණයේ
##ුන්ගේ
##ාන්ත්ර
වෛර
වයස
ඵල
දැර
දේශීය
##ෙකුගේ
ප්රවාහ
සැබ
##ොස්
ඇන්
තබ
කුරු
ජාල
ඩී
##ng
සිදුකර
සන්නිවේ
##ෂි
විවේ
##per
##මානු
##ber
එකතුව
ස්වරූප
අස්
අල්ලා
විශාලතම
රාශ
දර්ශන
##ෂධ
සිදුවූ
පැවැත්වුණු
පුත්ර
##ear
##වෙයි
ශාල
##පූ
##ිරු
ක්රියාකාරී
උපකරණ
##ition
රැගෙන
ධාර
##ීමත්
ගෞර
උදෙසා
වීමෙන්
උන්
පෙබර
සරල
එව
බන්ධ
##ත්වයෙන්
තෙල්
ජෝන්
වීර
වැඩසටහන්
##ෙය
at
##මක
##න්තුව
ගණිත
පූජ
අසා
පාඨ
දෙපාර්
එත
##ිකයන්
තරංග
පත්විය
විහාරය
අනුරාධපුර
දූ
ප්
##සියාවේ
ජූලි
##ඩය
##ුරා
සමු
පවස
සාගර
කොළ
තවමත්
ලැ
##රී
එල්
වෙරළ
##වීය
දිනා
##ෝදර
##වට
ඇද
මස්
බාහිර
##්යා
පිලි
මහත්
රඟ
මෙලෙස
දිශ
සිදුවිය
##ොල
ප්රාන්ත
තාරකා
මින්
අදහස
ධන
ප්රචල
##විධාන
දෙසැම්බර්
දීමට
විනි
කඳ
##බාහු
##ාවක
ch
නයි
හානි
ජනපදයේ
එංග
##ov
පිළිබදව
##ඥා
##ure
##ද්වී
සාම
සහභාගී
##ක්රමණ
us
කළමනා
සෙන්
ප්රතිසං
සාම්ප්රදායික
පරිවර්තනය
27
ගිනි
පුරාණ
##භා
##තනයේ
##ංකාර
##ated
ලෝහ
අයුරින්
විරෝධ
ජර්
##ලන්තය
චු
##ියු
##end
##ික්
##ත්තර
ගත්තේය
ආවේ
සම්ප්රදාය
##යාට
##ංගල
##pt
ගල
ගංග
##සැ
ප්රජ
එයින්
##දුනා
රේඛ
සංගමය
##ම්ම
##්ව
ඉන්දු
විකාශය
ඇයගේ
පෙබරවාරි
##ලාශ්ර
##edia
##ුණා
ප්රබල
##ටික්
which
කරා
සම්පත්
අතිශ
ගණනාවක්
යහ
පෙන්නුම්
දර්ශනය
##ort
##වාසික
සතුව
නිව්
ඉරා
කොන්
පරිපාල
ප්රතික්ර
2006
පැවතු
##ord
බොහො
නොමැ
සංස්කෘතිය
##ල්ලේ
රජතුමා
##දීමට
##ගෝ
##ින්ද
යාමට
2009
අන්තර්ජ
විජය
නොවූ
සහෝදර
අපි
මයි
බලන්න
කැටය
ජර්ම
##ere
##පෙන
රාජවංශ
කිලෝ
නිදහස
##000
ක්රමයෙන්
2010
##යන්ගෙන්
##land
##ුණුව
අලු
##ිකව
##ජාතික
නිෂ්පාද
විචාර
රචනා
ඖෂධ
##ත්රා
අරා
##ෆර්
form
න්යෂ්ට
මධ්යස්ථානය
අරමුණු
##ලන්
ගැනි
එළ
##මති
මැන
සන්ධ
##තාවයක්
දක්වයි
##ttp
ආලෝක
කෞ
comp
බර්
කර්
ප්රචාර
යුදෙව්
කුර
සුවිශේෂ
##මීට
##විනි
ඔක්තෝ
##ub
යානා
හදුනා
##ධිර
විභ
තුනක්
http
it
##ාව්ය
##නිසා
org
දූප
##ොල්
##ඳුම්
කුමරු
උද්ය
##න්දු
ඕස්ට්ර
තරුණ
ග්රීක
විදේශ
##ියාන
##ලියම්
පැවස
##ාග්
2000
ක්රමයක්
තනතුර
ඝාතනය
ප්රවේශ
හු
මහනුවර
##රුම්
අවස්ථාවල
##ගොඩ
un
දක්ෂ
##ther
යාන්ත්ර
කෙරුණු
ගණනක්
##ලිම්පික්
ලු
##ංස
ක්රිස්ත
සාකච්ඡ
අස්ථ
##යිඩ්
නොල
##තල
විශි
##ීමේදී
26
##වාර
පිවි
සංකේත
##හිමි
ලැබු
##ory
පිරිමි
සියලුම
ඔලිම්පික්
මානසික
##ave
උතුර
බදු
යන්
විසි
වෙනස්කම්
ලැබුවේ
ත්
ප්රයෝජ
##යෝගී
their
අලෙ
උෂ්ණත්වය
##ගාම
වූවා
භූමිය
බුදුන්
කුමාර
පහසුව
චක්ර
යන්ත්ර
##ත්තු
ප්රතිශ
මතය
පෘතු
සංවිධාන
රඳ
වචනය
ජයග්රහ
සොහ
##රික
##ායා
##ීන්ගේ
සිරුර
##ාවා
රෝම
අවට
එවිට
##වුර
විහි
2005
ලියා
කුමර
##ෙට්
##ේර
ප්රතික්ෂේප
##ary
සහාය
ඔවුන්ට
සංකල්ප
සජී
කිරීමයි
දේවාලය
28
##පතිවර
##ket
##ීමයි
අගනුවර
##ිලි
##ධික
##දානය
##ඩෝ
##ඟා
##මැත්ත
මීටර
ලෝකය
ප්රතිසංස්
අහ
##ree
සමහරක්
රුධිර
පුද්ගලයන්
190
මැතිවරණයෙහි
සොහොන්
කරති
වසරේදී
අපහසු
පියවර
ආවරණය
##නාත්මක
##ong
ගණන්
වන්ද
වගක
##වස
ආක්රමණය
ප්රචලිත
නු
##රූප
ගැහැ
අදාළ
##කී
##ක්ෂක
ත්රස්ත
සංයු
පැළ
දෙනෙකු
කේන්ද්ර
ජාන
වරක්
පිර
ලිපිය
අසල
තහවුරු
ඩොලර්
යළි
හුව
##ල්ඩ්
ගැල
1960
සඟ
නිතර
සම්මානය
ඉත
ඉල්ලා
##20
වරට
සිංහ
ඕස්ට්රේ
##රැ
##රිම
##ප්රා
බෝම්බ
ගාය
සිදුකරන
##රුව
සංකල්පය
##ලන්තයේ
පාද
මණ්ඩල
##බද්ධ
##ry
##rou
සංඝ
බෙහෙ
##so
##ක්ඛ
##යෙනි
189
තිය
##පොර
##යිට්
එකඟ
දකුණ
ස්වය
සිනමා
##රේ
වෙළෙ
අනාගත
Ind
##ok
##ක්ය
රෝගය
සංස්ථ
##ජය
##ඩර්
අන්තර්ජාතික
හමු
සමීප
සලකා
සදා
##පර්
ad
එබැ
දෑ
##ීන්ට
අපරාධ
##ction
##ence
##rit
##ස්ගේ
##න්නන්
කොට්ඨාස
නොවැම්බර්
නොමැත
##නන්ද
ප්රජා
##දනා
##ඟින්
සංඛ්යාවක්
##ධර්ම
2015
Th
##ණිජ
##cl
කලාපය
##irst
පරීක්ෂණ
##ations
සංකීර්ණ
##පාදනය
පහසුකම්
were
2012
නාව
##ෝන්
ඒකක
අවුරුද්
##ගනු
##සල්
සහිතව
පෙනේ
le
##ff
මුහුද
ගබ
##ge
ප්රතිචාර
##ර්ඝ
රටේ
40
මත්
##හට
##බ්බ
දෙදෙනා
අන්ද
බහුලව
##යන
සිල්
භූම
##ියානි
ලංකාවට
නිසාය
ඉගෙන
වහන්සේගේ
පළමුව
##ast
##ත්තිය
විකිර
සොහො
##aw
##ල්ලක්
පසුකාලීන
විශේෂිත
Un
ගස්
හෙයින්
දෙනා
හිට
##වූයේ
ඔවුහු
##ෙමින්
##ච්චි
හුවමාර
එම්
##ෙන්නට
සංර
##ank
ක්රියාකාරකම්
නවී
හිත
##කයෙකු
දුර්වල
එබැවින්
විලා
භාවිතයෙන්
හැඳින්වෙන
##du
ගියේය
##ide
##ථමික
උත්ස
කොට්ඨාශය
වෘත්ත
##ාවර
මීටර්
##ipedia
සබඳ
ස්වයං
##iz
කැප
අණු
වචන
සම්භ
විධි
##ස්ක
සැත
නියෝජනය
##oun
ලේඛන
කතෝල
29
sh
නේ
ඇත්
##මුන්
ඉන්දීය
මූලද්රව්ය
ක්රිපූ
මොහු
තහනම්
ජෛව
පටි
බස්
##තියි
ප්රාථමික
##ටික
##ඟු
##කාරක
##ational
විද්
වියද
##ාපිත
පෝෂ
දෙවි
##ame
##පුම්
##tern
##ාන්ත
##පස
තිබිය
සුළ
ලාංකික
විප්
##ූයේ
ලකුණු
අවකාශ
##ans
ඉංජිනේරු
ප්රවේ
තත්ත්ව
දො
වාසය
##ලූ
කෞතු
##ක්කය
කියන
##වර්ධන
හෙළ
ආරක්ෂාව
ගෙන්
2014
ඔහුව
හරි
##භය
පුහුණු
මනු
##වද
සමය
2011
පොළො
කැටයම්
##වක
##වයක්
##ස්තා
සැලකි
දෙයි
පූජා
ඉතාමත්
තාක්ෂණික
පින්
##50
2004
හැඳින්වෙන්නේ
උත්සව
ජර්මන්
විකි
සාපේක්ෂව
##ාවූ
සංයෝග
##ෂය
මෙමගින්
ටෙ
උරුම
##ප්පු
හඳුන්වනු
##වරුන්ගේ
බුද්ධි
විශ්වවිද්යාල
##ශි
කරන්නට
##ට්ටු
බලාපොර
ඔෆ්
සෙස
පක්ෂය
උපන්
සංගීතය
ස්වභාවික
සිටියේය
ප්රදර්ශනය
අයිතිවාසික
අමාත්ය
කාර්මික
##නියි
විශේෂයෙන්ම
##ish
වර්ගීකරණය
මෙරට
පවත්වාගෙන
හයිඩ්ර
##ේදය
නිවාස
නොද
##වලදී
වාර්තාව
he
##ණයන්
##ome
ඉන්පසු
sc
##ාකාර
වීමත්
තැනැ
res
කාව්ය
ජපන්
සමාගම්
##නයේදී
පරම්ප
##නුකූල
##ර්යෝ
මට්ටමේ
බොහොමයක්
ධර්මය
සන්
හවු
##ප්තිය
බැවිනි
යෙදු
හඳුන්වන
all
Eng
පවුලේ
තිබිණි
පාෂා
අධ්යයන
first
##ිරිය
කිරීමේදී
##ශීලී
කතෝලික
කුසල
දියණිය
අතීතයේ
හද
##ous
##රාව
අපට
රාම
##ාහ
##ass
වාර්ෂික
නිරීක්ෂණය
ගම
ගුර
##කැ
ගෝත්ර
ඉදිරියට
##දායක
##බන්ධ
##ියෝ
පරිමා
කෘති
කලේය
ser
මෙයින්
ක්රිස්තු
යුරෝපයේ
have
ටයි
ඉදිකිර
සිතිය
හිස
ගොවි
මූලාශ්ර
උණු
සති
##ින
බහුතර
ඉතිහාසයේ
වන්න
##cc
දැක්වීම
දුරට
තොරව
මතුපිට
##ගල්
නියු
ජීවිතය
නියෝජිත
ළමා
දෙයක්
ඉඩම්
ප්රතිඵලයක්
##ාංග
විධ
##විණි
පරිභ
අනුපා
##ස්ටර්
පදය
1970
ගිවිසුම
##ult
කාබන්
රැජින
##ධීන
අක්ෂර
බණ්ඩ
##ork
පිහිටුවා
ව්යුහ
ශතවර්
##orld
සමාජයේ
ඇමෙරිකානු
පොත්
188
2013
යනා
##ළුවන්
##ුවල
අවසර
බොහෝවිට
කෘතිය
තමන්ගේ
ආශ්රිත
##විර
##බව
##න්දා
දිවයි
අලංකාර
තැන්පත්
කක්ෂ
ගන්න
##වේදී
සමූහ
##දේශය
cont
##බාධ
හඳුන්වයි
##යක්ෂ
##ාරිත්ර
හොඳින්
කිරිමට
වෙස
